<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class AtGlancesSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {

        $atGlancesData = [
            [
                'category_id' => 1,
                'name' => 'برنامه نویس',
                'description' => '
                فرض کنید برنامه‌نویس مثل یک معمار ساختمان است، اما به جای ساختن خانه و آپارتمان، با استفاده از زبان‌های مخصوص کامپیوتر، برنامه‌ها و وب‌سایت‌ها را طراحی و می‌سازد.
                برنامه‌نویس‌ها با کدنویسی به کامپیوتر دستور می‌دهند که چه کاری انجام دهد. آنها از زبان‌های مختلف برنامه‌نویسی مثل پایتون، جاوا و سی پلاس پلاس استفاده می‌کنند که هر کدام برای ساختن نوع خاصی از برنامه‌ها یا وب‌سایت‌ها مناسب هستند.
                برنامه‌نویس‌ها می‌توانند اپلیکیشن‌های موبایل مثل اینستاگرام و تلگرام، وب‌سایت‌های مثل دیجی‌کالا و شیپور، نرم‌افزارهای کامپیوتری مثل فتوشاپ و آفیس، و حتی بازی‌های کامپیوتری را بسازند.
                علاوه بر کد نویسی، برنامه‌نویس‌ها باید منطق قوی داشته باشند، خلاق باشند و به جزئیات دقت کنند. آنها باید بتوانند مشکلات را حل کنند و با نرم‌افزارها و ابزارهای مختلف کار کنند.',
                'evidence' => 'نیاز ندارد',
                'skill' => json_encode(["HTML & CSS", "JavaScript", "react | Vue.js", "آشنایی با Git"]),
                'investment' => 'یک عدد لپتاپ یا کامپیوتر',
            ],
            [
                'category_id' => 2,
                'name' => 'وکیل',
                'description' => '
                وکیل، مدافع حقوق افراد در جامعه است. وکلا به کسانی که درگیر مشکلات حقوقی هستند، مشاوره می‌دهند و از آن‌ها در دادگاه‌ها و مراجع قانونی دفاع می‌کنند.
                فرض کنید که در یک تصادف رانندگی مقصر شناخته شده‌اید و باید به دادگاه بروید. در این شرایط، وکیل می‌تواند با بررسی مدارک و شواهد، بهترین راهکار قانونی را به شما ارائه دهد و در دادگاه از حقوق شما دفاع کند.
                وکلا باید به قوانین و مقررات اشراف کامل داشته باشند و مهارت سخن‌وری قوی داشته باشند تا بتوانند به بهترین شکل ممکن از موکل خود دفاع کنند. آنها همچنین باید صبور، دقیق و امیدوار باشند و بتوانند در شرایط پرفشار کار کنند.
                وکالت شغلی چالش‌برانگیز اما مهم و با ارزش است. وکلا با دفاع از حقوق موکلان خود، به ایجاد عدالت در جامعه کمک می‌کنند.
                علاوه بر موارد گفته شده، وکلا می‌توانند در زمینه‌های مختلفی مثل تنظیم قرارداد، ارائه مشاوره حقوقی به شرکت‌ها و سازمان‌ها، و انجام امور وکالتی مثل ثبت شرکت و املاک فعالیت کنند.',
                'evidence' => 'حقوق',
                'skill' => json_encode(["سخنوری", "تحقیق", "حل مسئله", "ارتباط"]),
                'investment' => 'نیاز ندارد',
            ],
            [
                'category_id' => 3,
                'name' => 'معلم',
                'description' => '
                معلمی شغلی است که در آن افراد دانش، مهارت‌ها و ارزش‌ها را به نسل‌های آینده منتقل می‌کنند. معلمان مانند راهنما و مربی عمل می‌کنند و به دانش‌آموزان کمک می‌کنند تا به استعدادهایشان پی ببرند و در مسیر درست زندگی قدم بردارند.
                معلمان در مدارس در مقاطع مختلف تحصیلی، از پیش‌ دبستانی تا دبیرستان، تدریس می‌کنند. آنها درس‌های مختلفی مثل ریاضی، علوم، فارسی، زبان انگلیسی، تاریخ و جغرافی را به دانش‌آموزان آموزش می‌دهند.
                علاوه بر تدریس درس، معلمان وظایف دیگری مثل ارائه تکلیف و امتحان، ارزیابی عملکرد دانش‌آموزان، برقراری ارتباط با اولیا، و ایجاد محیطی شاد و پویا در کلاس درس را نیز بر عهده دارند.
                معلمی شغلی پرمسئولیت اما پرفایده است. معلمان با صبر و حوصله و تعهد خود به آینده‌سازان کشور کمک می‌کنند تا به بهترین نسخه از خود تبدیل شوند.
                برای معلم شدن، افراد باید به آموزش و پرورش علاقه‌مند باشند و مهارت‌های ارتباطی قوی داشته باشند. آنها همچنین باید صبور، متعهد، خلاق و دارای روحیه‌ای فداکار باشند.',
                'evidence' => 'لیسانس',
                'skill' => json_encode(["تدریس", "صبر و حوصله", "همدلی", "انعطاف پذیری"]),
                'investment' => 'نیاز ندارد',
            ],
            [
                'category_id' => 4,
                'name' => 'فروشنده',
                'description' => '
                فرض کنید شما در یک مغازه لباس فروشی هستید و به دنبال خرید پیراهن می‌گردید. در اینجاست که فروشنده به شما کمک می‌کند تا پیراهنی مناسب پیدا کنید.
                فروشنده‌ها متخصصان فروش کالا و خدمات هستند. آنها با معرفی محصولات به مشتریان و پاسخ به سوالات آنها، به آنها کمک می‌کنند تا بهترین انتخاب را انجام دهند.
                فروشنده‌ها باید مهارت‌های ارتباطی قوی داشته باشند و بتوانند به خوبی با مشتریان ارتباط برقرار کنند. آنها همچنین باید صبور، مودب و خوش‌برخورد باشند تا بتوانند تجربه‌ای مثبت برای مشتریان رقم بزنند.
                علاوه بر مهارت‌های ارتباطی، فروشنده‌ها باید به محصولات یا خدماتی که می‌فروشند آشنایی کامل داشته باشند و بتوانند اطلاعات لازم را در مورد آنها به مشتریان ارائه دهند. آنها همچنین باید از مهارت‌های مذاکره برخوردار باشند تا بتوانند معاملات سودمند را برای خود و مشتریانشان انجام دهند.
                فروشندگی در محیط‌های مختلفی مثل فروشگاه‌ها، بازارها، نمایشگاه‌ها و به صورت آنلاین انجام می‌شود.',
                'evidence' => 'نیاز ندارد',
                'skill' => json_encode(["ارتباط", "مذاکره", "همدلی", "شناخت محصول"]),
                'investment' => 'نیاز ندارد',
            ],
            [
                'category_id' => 5,
                'name' => 'مترجم',
                'description' => '
                فرض کنید می‌خواهید داستانی را از فارسی به زبان انگلیسی ترجمه کنید. در اینجاست که مترجم به کمک شما می‌آید. مترجم کسی است که معنی و مفهوم یک متن را از یک زبان به زبان دیگر منتقل می‌کند.
                مترجم‌ها باید به هر دو زبان مبدا و مقصد به طور کامل مسلط باشند و به نواقص ظریف زبانی و فرهنگ دو زبان اشراف داشته باشند. آنها همچنین باید مهارت‌های نوشتاری قوی داشته باشند و بتوانند متنی روان و رسا به زبان مقصد تولید کنند.
                مترجم‌ها می‌توانند متون مختلفی مثل کتاب‌ها، مقالات، وب‌سایت‌ها، اسناد و مدارک، فیلم‌ها و سریال‌ها را ترجمه کنند.
                ترجمه می‌تواند به صورت آزاد یا ارائه شده توسط یک کارفرما انجام شود. مترجمان آزاد می‌توانند پروژه‌های مختلفی را از مشتریان مختلف دریافت کنند، در حالی که مترجمان شاغل در یک شرکت یا سازمان، روی پروژه‌های خاص کار می‌کنند.',
                'evidence' => 'نیاز ندارد',
                'skill' => json_encode(["زبان", "نویسندگی", "ابزارهای تجربه یار", "آشنایی با موضوع متن"]),
                'investment' => 'یک عدد لپتاپ یا کامپیوتر',
            ],
        ];

        foreach ($atGlancesData as $data) {
            DB::table('atglances')->insert($data);
        }
    }
}
