<?php

namespace Database\Seeders;

use App\Models\Category;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class CategorySeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $jobs = [
            'برنامه‌نویس',
            'طراح UI UX',
            'مدیر ارشد فنی (CTO)',
            'وکیل',
            'معلم',
            'نقاش',
            'طراح مدادرنگی',
            'مربی شنا',
            'فروشنده',
            'مدیر محصول', 
            'کارشناس کنترل کیفیت',
            'کارشناس ایمنی پالایشگاه',
            'کارشناس شیمی پالایشگاه',
            'آرایش‌گر',
            'تریدر',
            'کارشناس اتاق عمل',
            'کارشناس رادیولوژی',
            'کارگردان',
            'پرستار',
            'تکنسین داروخانه',
            'تعمیرکار موبایل',
            'آنلاین شاپ',
            'طراح گرافیک',
            'منشی',
            'مدرس زبان',
            'مسئول فنی و بهداشتی',
            'صنایع دستی',
            'راننده کامیون',
            'روانشناس',
            'ادمین اینستاگرام',
            'راننده لودر',
            'کارشناس بیمه',
            'کارشناس منابع انسانی',
            'حسابدار',
            'مسئول آزمایشگاه کارخانه',
            'طراح سایت',
            'ناظر و طراح تأسیسات ساختمان',
            'کارشناس بازرگانی',
            'دیتاساینتیست',
            'مترجم',
            'مربی آزمایشگاه شیمی',
        ];

        foreach ($jobs as $job) {
            Category::create(['title' => $job]);
        }

    }
}
